{"text": " Bromeliaceae mixed cultivated collection\nHumans have been using bromeliads for thousands of years. The Incas, Aztecs, Maya and others used them for food, protection, fiber and ceremony, just as they are still used today. European interest began when Spanish conquistadors returned with pineapple, which became so popular as an exotic food that the image of the pineapple was adapted into European art and sculpture. In 1776, the species Guzmania lingulata was introduced to Europe, causing a sensation among gardeners unfamiliar with such a plant. In 1828, Aechmea fasciata was brought to Europe, followed by Vriesea splendens in 1840. These transplants were so successful, they are still among the most widely grown bromeliad varieties.\n\nIn the 19th century, breeders in Belgium, France and the Netherlands started hybridizing plants for wholesale trade. Many exotic varieties were produced until World War I, which halted breeding programs and led to the loss of some species. The plants experienced a resurgence of popularity after World War II. Since then, Dutch, Belgian and North American nurseries have greatly expanded bromeliad production.\n\nOnly one bromeliad, the pineapple (Ananas comosus), is a commercially important food crop. Bromelain, a common ingredient in meat tenderizer, is extracted from pineapple stems. Many other bromeliads are popular ornamental plants, grown as both garden and houseplants.\n\nBromeliads are important food plants for many peoples. For example, the Pima of Mexico occasionally consume flowers of Tillandsia erubescens and T. recurvata due to their high sugar content; in Argentina and Bolivia, the shoot apices of T. rubella and T. maxima are consumed; in Venezuela, indigenous coastal tribes eat a sour-tasting but sweet-smelling berry, known as 'Maya', of Bromelia chrysantha as a fruit or in fermented beverages.[33]\n\nCollectors[edit]\nÉdouard André was a French collector/explorer whose many discoveries of bromeliads in the Cordilleras of South America would be influential on horticulturists to follow. He served as a source of inspiration to 20th-century collectors, in particular Mulford B. Foster and Lyman Smith of the United States and Werner Rauh of Germany and Michelle Jenkins of Australia.[34]\n\n"}