{"text": " Typical morphology of an Opuntia with fruit\nO. ficus-indica is a large, trunk-forming, segmented cactus that may grow to 5–7 m (16–23 ft) with a crown of over 3 m (10 ft) in diameter and a trunk diameter of 1 m (1 yd).[1] Cladodes (large pads) are green to blue-green, bearing few spines up to 2.5 cm (1 in) or may be spineless.[1] Prickly pears typically grow with flat, rounded cladodes (also called platyclades) containing large, smooth, fixed spines and small, hairlike prickles called glochids that readily adhere to skin or hair, then detach from the plant. The flowers are typically large, axillary, solitary, bisexual, and epiperigynous, with a perianth consisting of distinct, spirally arranged tepals and a hypanthium. The stamens are numerous and in spiral or whorled clusters, and the gynoecium has numerous inferior ovaries per carpel. Placentation is parietal, and the fruit is a berry with arillate seeds. Prickly pear species can vary greatly in habit; most are shrubs, but some, such as Opuntia galapageia of the Galápagos, are trees.\n\nEcology[edit]\n.mw-parser-output .hatnote{font-style:italic}.mw-parser-output div.hatnote{padding-left:1.6em;margin-bottom:0.5em}.mw-parser-output .hatnote i{font-style:normal}.mw-parser-output .hatnote+link+.hatnote{margin-top:-0.5em}\nSee also: Prickly pears in Australia\nO. ficus-indica thrives in regions with mild winters having a prolonged dry spell followed by hot summers with occasional rain and relatively low humidity.[1] A mean annual rainfall of 350–500 mm (14–19+1⁄2 in) provides good growth rates.[1] O. ficus-indica proliferates in various soils ranging from subacid to subalkaline, with clay content not exceeding 15–20% and the soil well-drained.[1] The shallow root system enables the plant to grow in shallow, loose soils, such as on mountain slopes.[1] Opuntia spreads into large clonal colonies, which contribute to its being considered a noxious weed in some places.[1][3]\n\nAnimals that eat Opuntia include the prickly pear island snail and Cyclura rock iguanas. The fruit are relished by many arid-land animals, chiefly birds, which thus help distribute the seeds. Opuntia pathogens include the sac fungus Colletotrichum coccodes and Sammons' Opuntia virus. The ant Crematogaster opuntiae and the spider Theridion opuntia are named because of their association with prickly pear cactus.\n\n"}